'use strict';

// Бинарный поиск — это алгоритм поиска элемента в отсортированном массиве, который на каждом шаге делит область поиска пополам

// Суть
// Смотрим на средний элемент области поиска.
// Если он равен искомому — нашли.
// Если средний больше искомого — ищем в левой половине.
// Если меньше — ищем в правой половине.
// Повторяем, пока область не сузится до одного элемента (или не станет пустой → элемента нет)

// Ключевые свойства
// Требование: массив должен быть отсортирован.
// Сложность: O(log n) по времени, O(1) по памяти.
// Почему быстро: каждый шаг отбрасывает половину оставшихся элементов — для 1 000 000 элементов нужно всего ~20 сравнений.


function binarySearch(list, item) {
    let low = 0; // Левая граница. При первом поиске мы идем по всему массиву, по начинаем с 0 индекса
    let high = list.length - 1; // Правая граница области. -1 потому что индексы с нуля 

    while (low <= high) { // Продолжаем поиск пока область поиска не пуста
        let mid = Math.floor((low + high) / 2); // Находим середину текущей области поиска
        let guess = list[mid]; // это наша «догадка» о том, где может быть искомое значение. С ним будем сравнивать item. Получается изначально догадка это средний по индексу элемент массива

        if (guess == item) { // Тут начинаются сравнения
            return mid;
        } else if (guess > item) {
            high = mid - 1;
        } else {
            low = mid + 1;
        }
    }

    return null;
}

let myList = [1, 3, 5, 7, 9];
let myList2 = [1, 5, 8, 13, 14, 28, 42, 183, 255, 561, 840, 1024];
console.log(binarySearch(myList2, 561)); // 9

let result = binarySearch(myList2, 561) + 1;
console.log(result); //10