// Задачи с совеселований
'use strict';

//  Какое будет выведено значение: 
 let x = 5; alert( x++ ); // 5 // потому что мы записали в постфиксной форме, если бы написали ++х, то будет 6

// Чему равно такое выражение: 
[ ] + false - null + true // NaN [] + false = false(string) - null = Nan + true = NaN

// Что выведет этот код: 
let y = 1; let x = y = 2; alert(x); // 2

// Чему равна сумма 
[ ] + 1 + 2 // 12

// Что выведет этот код: 
alert( '1'[0] ) // 1

// Чему равно 
2 && 1 && null && 0 && undefined // null

// Есть ли разница между выражениями? 
!!( a && b ) и (a && b) // Да, разница есть. !! первращает в булиновое значение

// Что выведет этот код: 
alert( null || 2 && 3 || 4 ); // 3

// Правда ли что a == b
a = [1, 2, 3]; b = [1, 2, 3]; // нет, тк это просто 2 доинаковых массива, но они не равны. Как бы это не одно и тоже

// Что выведет этот код: 
alert( +'Infinity'); // Infinity

// Верно ли сравнение: 
'Ёжик'>'яблоко' // нет

// Чему равно 
0 || '' || 2 || undefined || true || falsе // 2